import React from "react";

export default function TermsOfUse() {
  return (
    <div className="container mx-auto p-6">
      <h1 className="text-3xl font-bold mb-6">Условия использования</h1>
      <section className="prose prose-lg">
        <p>
          Добро пожаловать на сайт (&quot;Карта мероприятий&quot;)! Используя наш сайт, вы соглашаетесь с данными условиями
          использования. Если вы не согласны с этими условиями, пожалуйста, не используйте наш сайт.
        </p>
        <h2>1. Использование сайта</h2>
        <p>
          Вы обязуетесь использовать наш сайт только в законных целях и в соответствии с действующим
          законодательством. Запрещается использовать сайт для публикации или передачи незаконного контента.
        </p>
        <h2>2. Ограничение ответственности</h2>
        <p>
          Мы не несем ответственности за любые убытки или ущерб, возникшие в результате использования нашего сайта,
          включая, но не ограничиваясь, неточностью информации о событиях.
        </p>
        <h2>3. Изменения условий</h2>
        <p>
          Мы можем обновлять эти условия использования в любое время. Изменения вступают в силу с момента их
          публикации на сайте.
        </p>
        <h2>4. Контакты</h2>
        <p>
          Если у вас есть вопросы, свяжитесь с нами по адресу: support@eventmap.com.
        </p>
      </section>
    </div>
  );
}
